Revit 2027 API
EnergyDataSettings.CheckRangeOfSliverSpaceTolerance Method
 Checks that the sliver space tolerance is greater than or equal to zero.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckRangeOfSliverSpaceTolerance(
	double silverSpaceTolerance
)
Public Shared Function CheckRangeOfSliverSpaceTolerance (
	silverSpaceTolerance As Double
) As Boolean
public:
static bool CheckRangeOfSliverSpaceTolerance(
	double silverSpaceTolerance
)
static member CheckRangeOfSliverSpaceTolerance :
        silverSpaceTolerance : float -> bool
Parameters
silverSpaceTolerance Double
 The sliver space tolerance to be checked.
Return Value
Boolean
 Returns true if the sliver space tolerance is greater than or equal to zero, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace